W9D2/art_share_api/app/models/artwork.rb

    def self.art_to_view(user_id)
        user = User.find(user_id)
        to_view = []
        created = Artwork.where(artist_id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]