W9D3/Cats_99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @kitty = Cat.all

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @kitty = Cat.find(params[:id])