W9D2/art_share_api/app/controllers/artworks_controller.rb

  def index

    if params.has_key?(:user_id)
      # index of nested resource
      render json: Artwork.art_to_view(params[:user_id])
    else
      render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "qwert"], ["image_url", "asdfgh"], ["artist_id", 1]]

  def show
    render json: Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])

    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "\"change\""], ["id", 3]]