W9D2/art_share_api/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(share_params)
        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1]]

    def destroy
        share = ArtworkShare.find(params[:id])
        share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]