W9D2/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    if params.has_key?(:user_id)
      # index of nested resource
      render json: Comment.comment_to_view(params[:user_id])
    elsif params.has_key?(:artwork_id)
      render json: Comment.artwork_comment(params[:artwork_id])
    else
      render json: Comment.all

INSERT INTO "comments" ("artwork_id", "user_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["artwork_id", 1], ["user_id", 1], ["body", "oh ham, clam sammy, this is great"]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    comment = Comment.find(params[:id])
    comment.destroy