W9D2/art_share_api/app/controllers/users_controller.rb

    def index
        if params[:query]
            render json: User.where('users.username LIKE ?', params[:query])
        else
            render json: User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("email", "name") VALUES ($1, $2) RETURNING "id"  [["email", "narsty@email.com"], ["name", "chadwick"]]

    def show
        render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "jaek"], ["email", "aekkk@email.com"], ["id", 1]]

    def destroy
        user = User.find(params[:id])
        user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]