W10D4/read_it/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "4Ace0Bh1l5KqeSiko2QN5Q"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by_session_token(session[:session_token])