W10D4/read_it/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        # debugger
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        @post = current_user.posts.find_by(id: params[:id])
        @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]