W10D4/read_it/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Harry Potter"], ["description", "He's a wizard! Duh!"], ["moderator_id", 1], ["created_at", "2019-09-05 20:43:16.078311"], ["updated_at", "2019-09-05 20:43:16.078311"]]

    def show
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @sub = current_user.subs.find_by(id: params[:id])

        if @sub
            @sub.update_attributes(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "He's a wizard! Duh! "], ["updated_at", "2019-09-05 21:10:37.704726"], ["id", 2]]

    def destroy
        @sub = current_user.subs.find_by(id: params[:id])
        @sub.destroy
---
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 1]]