W10D4/read_it/app/views/posts/new.html.erb

    <h4>Where do you want to send this sucker?</h4>
    <% Sub.all.each do |ele| %>
---
SELECT "subs".* FROM "subs"