W10D4/read_it/app/views/subs/show.html.erb

  <ol>
    <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 2]]