W10D4/read_it/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dcK6XAm6FjEttAw2WE_PfQ"], ["updated_at", "2019-09-05 22:28:52.187160"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save